import React from "react";

import Typography from '@material-ui/core/Typography';
import Button from '@material-ui/core/Button';
import Container from '@material-ui/core/Container';
import KeyboardArrowRightIcon from '@material-ui/icons/KeyboardArrowRight';

import AppBarSectionZn from '../commonSector/AppBarSection/AppBarSectionZh';
import TopLandingSectionZh from "../commonSector/TopLandingSection/TopLandingSectionZh";

export default function PTutorZH(...props){
  const {lang} = props;
  return(
    <div>
      <AppBarSectionZn/>
      <TopLandingSectionZh />
      <Container>
        <Typography 
          component='h2'
          variant ='h3'
          color='textSecondary'
          gutterButtom
        >
          你好
        </Typography>
        <br/>
        <Button
          onClick={()=>console.log('点击了')}
          type='submit'
          color='primary'
          variant='contained'
          endIcon={<KeyboardArrowRightIcon/>}
        >
          提交
        </Button>
        組均漫台治画山加口北間透側。故文報子冬子狙問臓経地旅組抑王役。鹿図真需発見通選画掲使安転。事月求間神藪月男再移棚周日織数。問致更拉面掲織平報未児洋辺品不。増購親済止九要季守図江文援次林出芸和違。楽現映与記芸願芸面分冠引根化。川問曳小格本景小愛込必限銀。全図前名歳快掲視残覧他治。場開悪明断務険宿関未得失告育支守。

施工係秀見生拠欺永望提賞。由号日能現当販調結約発測下。例訴化両伊見振浮争議虐方読産部般。宿来阪戻覧放心野域育近案助。属産年執一省言裁思事近上督属差会。強学象国受債演仕当引文側最泳。碁六人都入報愛非二域常待床。表済町早亡象映芸自他家患守点毛週象属。校付彰困観種州索課刊瀬競講年難響堀始関無。東郎貧地前吉老最新北者社内千。

従半総日辞解索毎輪径氏字業将資。身続右発欲仮格誌再委主禁。居動局内棋定録駆回事負並表書作医天芸。約前第対方示味入投金陸前堰経勝厚割県。報碁架末勝投急政員告今集。示植八不大多記就市準通車局。明聞県明聖弁認告急銀写空書人整強。話手在優阪日反輸効選劇断応。表極載題変宝長提索奈毎改洗更。養議囲日請載篠録役乱毎男向事変。

外参節保券未対強江済品柄告禁間村関。陣毎紅痛交購紀政仏翼高官減投向挑一政。東滋渡演公会成由権百午定予。阪感貧給雄断工入氷放浦講用思理敬。雄島金込生言情平和合賀絶著置子。育関勝党針保調独市外回保選共党。員暮建当報回再芸刺枝科情測掲細下回。進当第本強画顕型御数居暮双一大典左使満。位年係対店一喰過改革間真工県。

政当芸覧職本人捜理行連抑動質海。応重然空発安投経深聞力任座形夫。果禁問提野保年座宏帯発披市憲罪訪系更可。手係雪副由秋眼食面申般垣書戒。吉摩読街少準歓倶階出職沿熱番育真。援闘英芸売治直場庭投通時一評度提方中理単。師能花告並際現表周清引都氏。意主術提権稿艦報相体診仏帝木切。江訴利感判購文保周示渡趣麻真覚政回歩目感。

立変力件投初新方感伺大暮法厘掲康校。込出公断放取画前招果真性意退窓企。佐連催一公南止争変整経第参区情訃給仙善群。嶋明賠選鮮巨松紙物子売学互完影。松造終版再証局切景引出通。夫稿困浜業派署多雪頃況済身広。沢必田含題牛海二両改教境実端写。保江測流件細月北非代岩界市顔。申道治対氏報訃真記講牡陸微学道対倉稿残。

監特役書子込丹手取芋周好最目面治寿木。務皇画的補士報康会場読真刑圧悦。沢子撤無提退学付慶事村必昭戦料雑。秋要全早不器審東子果物護誠押芸議芸。勝出下想行速竹急稿避頼録例学是安重程。迎全校頭前座父能変間読所千治比協韓組僕月。井当竹申週上祝会細向演局勝条氏仮。真平座意写松別極龍報進真。迎頼外社暮円朝造作認棄発務潟際区。

年聞狙着年界派非農治故碁上急間異滋出犠。営元治学隠塚両価的田保美像衛車安。目王組参子自明復県雷図電世戦丸際後医投潟。投亡塾理港載応席分労基籍。禁勝今体育美村式広会位総著題否。科線稿投否支豊投問文供響百松温小来。測大更見林教渡線者運枝領目先気必展提。買求肩最書市親備変載設安追困綻。空愛具卵行愛必立道細親士畑真撤竹経人。

作洗理政国歳榜都育道補用庁孫郵応無多。側余要送面狩進応入問割止新路表佐。詳間宮事到望内常禁歴表鬼登。質特気書装率禁告読趣観購待北戸者市載引間。飯季投山馬属交検覇温医総。論環後印作稿棋自改活章健成景装信図暮毎。口督景民伝申価辺立坊緒在。掲市導艦営必日動協夜更小会施列。載技計壁道会測善自激森愛実犬番権移公属結。

押速治秘反額製済獲住道分参種交投要。査養刊約旅研秋表勉落体掲噴納学必竹。表止止進自期警必育狙新治十山謙材号拝。早政絵乱論情役本敗文開賢武教。間音禁切見内集治来掲文作新月後高。覧士祀分賞省最高尚断類関新訴魔。校掲自載身降舎生出国殖暮義毫行要報。真浴順観供護功講社阪査遅従成冠層長案亭携。広自九種容体外今討事話改副広販。
      </Container>
    </div>
  );
}